Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.GetAttributeFiles Method
 Gets attribute files with specified suffix from model, XS_FIRM and XS_PROJECT directories and subdirectories.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<string> GetAttributeFiles(
	string suffix
)
Public Shared Function GetAttributeFiles (
	suffix As String
) As List(Of String)
Parameters
suffix
Type: System.String
The filename suffix.
Return Value
Type: List<String>
A list of found file names
See Also
Reference
EnvironmentFiles Class
Tekla.Structures.Dialog.UIControls Namespace